uhnp/src/InformationRegisters/НастройкиПравДоступаПользователейВидыОтчетов/НастройкиПравДоступаПользователейВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПравДоступаПользователейВидыОтчетов</name>
  <resources>
    <name>ВидДоступа</name>
    <type>
      <types>EnumRef.ВидыДоступа</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ГруппыДоступаОрганизацииВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
      <types>CatalogRef.ГруппыДоступаКВидамОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПользователиВидыОтчетов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь32</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПользователиВидыОтчетов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиПравДоступаПользователейВидыОтчетов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем НастройкаВидыОтчетов;
	Перем НастройкаОрганизации;
	Перем НастройкаПользователи;
	Перем ОтборВидыОтчетов;
	Перем ОтборОрганизации;
	Перем ОтборПользователи;

	Параметры.Свойство("НастройкаВидыОтчетов",НастройкаВидыОтчетов);
	Параметры.Свойство("НастройкаОрганизации",НастройкаОрганизации);
	Параметры.Свойство("НастройкаПользователи",НастройкаПользователи);
	
	Параметры.Свойство("ОтборВидыОтчетов",ОтборВидыОтчетов);
	Параметры.Свойство("ОтборОрганизации",ОтборОрганизации);
	Параметры.Свойство("ОтборПользователи",ОтборПользователи);
	
	Если НастройкаОрганизации=1 Тогда
		
		Элементы.Организация.ОграничениеТипа=Новый ОписаниеТипов("СправочникСсылка.Организации");
		Элементы.Организация.Заголовок=Нстр("ru = 'Организация'");
		
	ИначеЕсли НастройкаОрганизации=2 Тогда
		
		Элементы.Организация.ОграничениеТипа=Новый ОписаниеТипов("СправочникСсылка.ГруппыДоступаОрганизацииВидыОтчетов");
		Элементы.Организация.Заголовок=Нстр("ru = 'Группа доступа к организациям'");
		
	КонецЕсли;
	
	Если НастройкаВидыОтчетов=1 Тогда
		
		Элементы.ВидОтчета.ОграничениеТипа=Новый ОписаниеТипов("СправочникСсылка.ВидыОтчетов");
		Элементы.ВидОтчета.Заголовок=Нстр("ru = 'Вид отчета'");
	
	ИначеЕсли НастройкаВидыОтчетов=2 Тогда
		
		Элементы.ВидОтчета.ОграничениеТипа=Новый ОписаниеТипов("СправочникСсылка.ГруппыДоступаКВидамОтчетов");
		Элементы.ВидОтчета.Заголовок=Нстр("ru = 'Группа доступа к видам отчетов'")
		
	КонецЕсли;
	
	Если НастройкаПользователи=1 Тогда
		
		Элементы.Пользователь.ОграничениеТипа=Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		Элементы.Пользователь.Заголовок=Нстр("ru = 'Пользователь'");
	
	ИначеЕсли НастройкаПользователи=2 Тогда
		
		Элементы.Пользователь.ОграничениеТипа=Новый ОписаниеТипов("СправочникСсылка.ГруппыДоступаПользователиВидыОтчетов");
		Элементы.Пользователь.Заголовок=Нстр("ru = 'Группа пользователей'");
		
	КонецЕсли;	
	
	ОбработатьУстановленныйОтбор("ВидОтчета",ОтборВидыОтчетов);
	ОбработатьУстановленныйОтбор("Организация",ОтборОрганизации);
	ОбработатьУстановленныйОтбор("Пользователь",ОтборПользователи);
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьУстановленныйОтбор(ИмяЭлемента,ЗначениеОтбора)
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		
		Элементы[ИмяЭлемента].Доступность=Ложь;
		
		Если НЕ ЗначениеЗаполнено(Запись[ИмяЭлемента]) Тогда
			
			Запись[ИмяЭлемента]=ЗначениеОтбора;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры // ОбработатьУстановленныйОтбор() 



&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененаЗаписьПравПользователейВидыОтчетов");
	
КонецПроцедуры
